---
kind: property
id: P:Autodesk.Revit.DB.HermiteFace.Params(System.Int32)
source: html/5c1a86f8-8c09-6186-6a4c-3fe0bb9c5034.htm
---
# Autodesk.Revit.DB.HermiteFace.Params Property

Parameters of the surface.

## Syntax (C#)
```csharp
public DoubleArray this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)